<?xml version="1.0" ?>
<net name="ru_quartznet" version="10">
	<layers>
		<layer id="0" name="audio_signal" type="Parameter" version="opset1">
			<data shape="1, 64, 256" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="audio_signal">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="encoder.encoder.0.mconv.0.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="64, 1, 1, 33" offset="0" size="8448"/>
			<output>
				<port id="0" precision="FP32" names="encoder.encoder.0.mconv.0.conv.weight">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>33</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Conv_0" type="GroupConvolution" version="opset1">
			<data strides="2" pads_begin="16" pads_end="16" dilations="1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>33</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="640">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="1000" type="Const" version="opset1">
			<data element_type="f32" shape="256, 64, 1" offset="8448" size="65536"/>
			<output>
				<port id="0" precision="FP32" names="1000">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Conv_1/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Conv_1/Dims5185" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1" offset="73984" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Conv_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="999">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Relu_2" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="643">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="encoder.encoder.1.mconv.0.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="256, 1, 1, 33" offset="75008" size="33792"/>
			<output>
				<port id="0" precision="FP32" names="encoder.encoder.1.mconv.0.conv.weight">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>33</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Conv_3" type="GroupConvolution" version="opset1">
			<data strides="1" pads_begin="16" pads_end="16" dilations="1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>33</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="644">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="1003" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256, 1" offset="108800" size="262144"/>
			<output>
				<port id="0" precision="FP32" names="1003">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Conv_4/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Conv_4/Dims5293" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1" offset="370944" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Conv_4" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1002">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Relu_5" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="647">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="encoder.encoder.1.mconv.5.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="256, 1, 1, 33" offset="371968" size="33792"/>
			<output>
				<port id="0" precision="FP32" names="encoder.encoder.1.mconv.5.conv.weight">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>33</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Conv_6" type="GroupConvolution" version="opset1">
			<data strides="1" pads_begin="16" pads_end="16" dilations="1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>33</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="648">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="1006" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256, 1" offset="405760" size="262144"/>
			<output>
				<port id="0" precision="FP32" names="1006">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Conv_7/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Conv_7/Dims5395" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1" offset="667904" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Conv_7" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1005">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Relu_8" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="651">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="encoder.encoder.1.mconv.10.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="256, 1, 1, 33" offset="668928" size="33792"/>
			<output>
				<port id="0" precision="FP32" names="encoder.encoder.1.mconv.10.conv.weight">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>33</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Conv_9" type="GroupConvolution" version="opset1">
			<data strides="1" pads_begin="16" pads_end="16" dilations="1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>33</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="652">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="1009" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256, 1" offset="702720" size="262144"/>
			<output>
				<port id="0" precision="FP32" names="1009">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Conv_10/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Conv_10/Dims4921" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1" offset="964864" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Conv_10" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1008">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Relu_11" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="655">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="encoder.encoder.1.mconv.15.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="256, 1, 1, 33" offset="965888" size="33792"/>
			<output>
				<port id="0" precision="FP32" names="encoder.encoder.1.mconv.15.conv.weight">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>33</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Conv_12" type="GroupConvolution" version="opset1">
			<data strides="1" pads_begin="16" pads_end="16" dilations="1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>33</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="656">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="1012" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256, 1" offset="999680" size="262144"/>
			<output>
				<port id="0" precision="FP32" names="1012">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Conv_13/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Conv_13/Dims5047" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1" offset="1261824" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Conv_13" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1011">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Relu_14" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="659">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="encoder.encoder.1.mconv.20.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="256, 1, 1, 33" offset="1262848" size="33792"/>
			<output>
				<port id="0" precision="FP32" names="encoder.encoder.1.mconv.20.conv.weight">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>33</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Conv_15" type="GroupConvolution" version="opset1">
			<data strides="1" pads_begin="16" pads_end="16" dilations="1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>33</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="660">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="1015" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256, 1" offset="1296640" size="262144"/>
			<output>
				<port id="0" precision="FP32" names="1015">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Conv_16/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Conv_16/Dims5167" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1" offset="1558784" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Conv_16" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1014">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="1018" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256, 1" offset="1559808" size="262144"/>
			<output>
				<port id="0" precision="FP32" names="1018">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Conv_17/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Conv_17/Dims4909" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1" offset="1821952" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Conv_17" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1017">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Add_18" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="665">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Relu_19" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="666">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="encoder.encoder.2.mconv.0.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="256, 1, 1, 33" offset="1822976" size="33792"/>
			<output>
				<port id="0" precision="FP32" names="encoder.encoder.2.mconv.0.conv.weight">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>33</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Conv_20" type="GroupConvolution" version="opset1">
			<data strides="1" pads_begin="16" pads_end="16" dilations="1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>33</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="667">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="1021" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256, 1" offset="1856768" size="262144"/>
			<output>
				<port id="0" precision="FP32" names="1021">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Conv_21/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Conv_21/Dims5035" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1" offset="2118912" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Conv_21" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1020">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Relu_22" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="670">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="encoder.encoder.2.mconv.5.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="256, 1, 1, 33" offset="2119936" size="33792"/>
			<output>
				<port id="0" precision="FP32" names="encoder.encoder.2.mconv.5.conv.weight">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>33</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Conv_23" type="GroupConvolution" version="opset1">
			<data strides="1" pads_begin="16" pads_end="16" dilations="1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>33</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="671">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="1024" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256, 1" offset="2153728" size="262144"/>
			<output>
				<port id="0" precision="FP32" names="1024">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Conv_24/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Conv_24/Dims5251" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1" offset="2415872" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Conv_24" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1023">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Relu_25" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="674">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="encoder.encoder.2.mconv.10.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="256, 1, 1, 33" offset="2416896" size="33792"/>
			<output>
				<port id="0" precision="FP32" names="encoder.encoder.2.mconv.10.conv.weight">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>33</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Conv_26" type="GroupConvolution" version="opset1">
			<data strides="1" pads_begin="16" pads_end="16" dilations="1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>33</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="675">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="1027" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256, 1" offset="2450688" size="262144"/>
			<output>
				<port id="0" precision="FP32" names="1027">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Conv_27/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Conv_27/Dims4951" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1" offset="2712832" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Conv_27" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1026">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Relu_28" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="678">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="encoder.encoder.2.mconv.15.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="256, 1, 1, 33" offset="2713856" size="33792"/>
			<output>
				<port id="0" precision="FP32" names="encoder.encoder.2.mconv.15.conv.weight">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>33</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Conv_29" type="GroupConvolution" version="opset1">
			<data strides="1" pads_begin="16" pads_end="16" dilations="1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>33</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="679">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="1030" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256, 1" offset="2747648" size="262144"/>
			<output>
				<port id="0" precision="FP32" names="1030">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Conv_30/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Conv_30/Dims5329" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1" offset="3009792" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Conv_30" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1029">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Relu_31" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="682">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="encoder.encoder.2.mconv.20.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="256, 1, 1, 33" offset="3010816" size="33792"/>
			<output>
				<port id="0" precision="FP32" names="encoder.encoder.2.mconv.20.conv.weight">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>33</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Conv_32" type="GroupConvolution" version="opset1">
			<data strides="1" pads_begin="16" pads_end="16" dilations="1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>33</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="683">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="1033" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256, 1" offset="3044608" size="262144"/>
			<output>
				<port id="0" precision="FP32" names="1033">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Conv_33/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Conv_33/Dims4969" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1" offset="3306752" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Conv_33" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1032">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="1036" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256, 1" offset="3307776" size="262144"/>
			<output>
				<port id="0" precision="FP32" names="1036">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Conv_34/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Conv_34/Dims5203" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1" offset="3569920" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Conv_34" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1035">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Add_35" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="688">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Relu_36" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="689">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="encoder.encoder.3.mconv.0.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="256, 1, 1, 33" offset="3570944" size="33792"/>
			<output>
				<port id="0" precision="FP32" names="encoder.encoder.3.mconv.0.conv.weight">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>33</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Conv_37" type="GroupConvolution" version="opset1">
			<data strides="1" pads_begin="16" pads_end="16" dilations="1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>33</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="690">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="1039" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256, 1" offset="3604736" size="262144"/>
			<output>
				<port id="0" precision="FP32" names="1039">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Conv_38/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Conv_38/Dims4957" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1" offset="3866880" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Conv_38" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1038">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Relu_39" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="693">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="encoder.encoder.3.mconv.5.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="256, 1, 1, 33" offset="3867904" size="33792"/>
			<output>
				<port id="0" precision="FP32" names="encoder.encoder.3.mconv.5.conv.weight">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>33</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Conv_40" type="GroupConvolution" version="opset1">
			<data strides="1" pads_begin="16" pads_end="16" dilations="1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>33</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="694">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="1042" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256, 1" offset="3901696" size="262144"/>
			<output>
				<port id="0" precision="FP32" names="1042">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Conv_41/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Conv_41/Dims4981" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1" offset="4163840" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Conv_41" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1041">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Relu_42" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="697">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="encoder.encoder.3.mconv.10.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="256, 1, 1, 33" offset="4164864" size="33792"/>
			<output>
				<port id="0" precision="FP32" names="encoder.encoder.3.mconv.10.conv.weight">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>33</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Conv_43" type="GroupConvolution" version="opset1">
			<data strides="1" pads_begin="16" pads_end="16" dilations="1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>33</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="698">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="1045" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256, 1" offset="4198656" size="262144"/>
			<output>
				<port id="0" precision="FP32" names="1045">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Conv_44/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Conv_44/Dims5155" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1" offset="4460800" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Conv_44" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1044">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Relu_45" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="701">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="encoder.encoder.3.mconv.15.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="256, 1, 1, 33" offset="4461824" size="33792"/>
			<output>
				<port id="0" precision="FP32" names="encoder.encoder.3.mconv.15.conv.weight">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>33</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Conv_46" type="GroupConvolution" version="opset1">
			<data strides="1" pads_begin="16" pads_end="16" dilations="1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>33</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="702">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="1048" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256, 1" offset="4495616" size="262144"/>
			<output>
				<port id="0" precision="FP32" names="1048">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Conv_47/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Conv_47/Dims5257" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1" offset="4757760" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Conv_47" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1047">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Relu_48" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="705">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="encoder.encoder.3.mconv.20.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="256, 1, 1, 33" offset="4758784" size="33792"/>
			<output>
				<port id="0" precision="FP32" names="encoder.encoder.3.mconv.20.conv.weight">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>33</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Conv_49" type="GroupConvolution" version="opset1">
			<data strides="1" pads_begin="16" pads_end="16" dilations="1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>33</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="706">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="1051" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256, 1" offset="4792576" size="262144"/>
			<output>
				<port id="0" precision="FP32" names="1051">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="Conv_50/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="Conv_50/Dims5281" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1" offset="5054720" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="Conv_50" type="Add" version="opset1">
